Pictr/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "GWLXaIsn8FDfczuJgjg+fw=="], ["updated_at", "2021-11-23 16:50:42.247391"], ["id", 1]]